Firma/nalog_encrypted_and_signed.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><ns2:getNalogZaPlacanjeRequest xmlns:ns2="http://nalogZaPlacanje.xml.com" xmlns:ns3="http://zahtevzadobijanjeizvoda.xml.com"><xenc:EncryptedData xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" Type="http://www.w3.org/2001/04/xmlenc#Content"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#tripledes-cbc"/><ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:KeyName>Sifrovan tajni kljuc</ds:KeyName>
<xenc:EncryptedKey><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-1_5"/><xenc:CipherData><xenc:CipherValue>HmVDofJGWFb5DisxWQNOXdPpdYCdcLHyZTg9yqMt0R+hVpGPTg3ZmuDG2EY/3GDIGlzvGQ3pDDLX&#13;
+6iajVGtYyy7Q6j+cJbUTAfPcv+TUidhEL5AKT0YnpB5q/p8unhw048yMJpQwtRUkX5BVwTP/Yl5&#13;
QwHF6pREk88Cjd/sRHPWENlTjK3RikhdVGaSPfJdX7TChMiWFXYTll9ceAgvcW1nKmQVDIcwm2fz&#13;
Io1kugiKK2DCvQciZwTRCVJzdJxyVWkDhrqGciC798V912c0nnQ56kqCs9l9FNpS9iND5qKOd6Ze&#13;
9Kk2xYIhFbfH/L05ZFNIR9T8lov0OIYPCmmoNQ==</xenc:CipherValue></xenc:CipherData></xenc:EncryptedKey></ds:KeyInfo><xenc:CipherData><xenc:CipherValue>4eIVJF+tRnqycENsWPizjzqxAGZFAMCaR7JX3s8CtBBV8Mte199J0xtl5HiS/tH41pHbYBgIPaD4&#13;
YVh4kjj+SkokkwRCrZYpvnOs2fbJA1soA6CBBZJC1IXAZJl7ff7mPj4MXmcFVEUXLP8+zB7y+j/p&#13;
dTJut6Dj4oPPm7NlYYepcC75snOn3P539Dgq50cac+Mg+4q+5FUoo1q3GEGmlFanZYSKXLIFYABE&#13;
UwQT77NAZRdSSlwTfyyI8boua2IzO7fwba5MwuDfa4a5Ad8SwQ1lPyXIR25OHo310Gy+9mIFiams&#13;
0HbmqOyBZ0fMHI5J+jHw0pKsekw9tPRCI3CYVH5H+/RulMC3JTk/mNRBG9KdbWMcGagMiAx5gYzC&#13;
UbVyVDjR0cYFJFv3ZWH1IcJNsdMpiZBPc3+DSGaME1ikxEDVigRgj0IubvdSt4tkLxW0ryC0YZnU&#13;
xX+Q8A5ExvWKoqU9NGRWWMLhcKaGW20dSsCzS4PrklGp28kwa7G6Gn7Jn1YPULxxHoShx/ThlBwl&#13;
rSDrBNM+5Chh2Yn8h8cKsg253O6oeTUDCrgJvBH6Nvi2S5ozk7+s4rT7e7FqRVabK2SsSa8n3bW3&#13;
yyhECDRkncv8VIk0YAj8bNiZFAHdvXJzOdhSYgHjO4cdKCDpORccNSIbcK0qiEdI0iTEFAxi67Ji&#13;
V3VOW1yaNczRM+fV6DaGwUPvQymgqqElMAQc5WCXhNBl/Vdiu+aS6pEpRTF7ga7ixqq5QoAe2IoC&#13;
JtQDHNCgupY4JV3g9oa9LFvGh0fT49Y0haXAEAMmVz2IwCA7hu8V3Rcs8oozVTf1JUywnhkxx0NA&#13;
X+mwKMyw+eSys5wfYbJAukabszoA1jsrJihdZBk2l9cz5J9l2PHinMuJ3tDwPlF3LpZTVE3bPdbG&#13;
f6tzYbxIBoBkMQfW8mz/cQKgUCE+ImmFtRSLP9TeLVZQQ2CZ</xenc:CipherValue></xenc:CipherData></xenc:EncryptedData></ns2:getNalogZaPlacanjeRequest></SOAP-ENV:Body><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:SignedInfo>
<ds:CanonicalizationMethod Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315"/>
<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
<ds:Reference URI="">
<ds:Transforms>
<ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/>
<ds:Transform Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315#WithComments"/>
</ds:Transforms>
<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
<ds:DigestValue>XKRT8FRXQEDIWVdVDs7K79zhsKw=</ds:DigestValue>
</ds:Reference>
</ds:SignedInfo>
<ds:SignatureValue>
g2N5W9KiOKZhLbmOPgbv9dqAhh1zMbsux02MtxGsN5cel1cZ6SeBWFPGIOjMqEzt+nZFpA2j0DSC&#13;
CVSyFnrqvApZfvXhMGx+urLbNjJi4UTya58wVnQgwMkvklia3+PYpCIi62TybT4u3mRxBYS11gox&#13;
V9fn4xDfscM7oDNr69dHBxWpKAo4amilXzV6sXN5iVhjGFY3JV+YaIZa+sRFSpU0gJI+f4/BRqpG&#13;
r2rmHSungCpxgE/hfb3pj08cQ4yeZQ214JbvyY4h7Hx1Flwc6TVlW3eIy2owf5P4L60lfMNU0zyI&#13;
q4Z3xxz6K057C35RSvCeiMtAdazGgS6uBF2dlg==
</ds:SignatureValue>
<ds:KeyInfo>
<ds:KeyValue>
<ds:RSAKeyValue>
<ds:Modulus>
qvq9L4TdlpRND/aAnYa969IckeVyjGtDV1DHs/GvtFYRHuW6giXxjm3SUtVtTQoRTIoqBSLfpMBe&#13;
JODaAh6rACQpAgWymU4pbRXz7UIPhhpkyNeEXwtl63ILNOtIj6bMGtKnj6cmMYzNvUoQBixbFTSg&#13;
ixi3O996Z/YvRQLgW1obxiooCBoZuFEnFlfcUzCtHE5XmvZUWs4EjNA/oj9H2rJ34SMBz89XNyTl&#13;
0TBQh4ZPYw0WxzDJAyrtAGLWaPq1vOyA8PnXX33kQHGB7ZJVTVDlsFoD3ftWYQ63/LPshqM3P8BE&#13;
/uav8luUhVcVRDCDfvvpvmmJSVi7fK0zY4QQ7Q==
</ds:Modulus>
<ds:Exponent>AQAB</ds:Exponent>
</ds:RSAKeyValue>
</ds:KeyValue>
<ds:X509Data>
<ds:X509Certificate>
MIIDgjCCAmqgAwIBAgIEWUhRPjANBgkqhkiG9w0BAQsFADB6MRAwDgYDVQQDDAdCYW5rYSBBMRAw&#13;
DgYDVQQKDAdCYW5rYSBBMQ4wDAYDVQQLDAVCYW5rYTEMMAoGA1UEBhMDc3JiMRowGAYJKoZIhvcN&#13;
AQkBFgtiYW5rYUBhLmNvbTEaMBgGCgmSJomT8ixkAQEMCjE0OTc5MTE0OTIwHhcNMTcwNjE5MDAw&#13;
MDAwWhcNMTgwNjE5MDAwMDAwWjB6MRAwDgYDVQQDDAdGaXJtYSBBMRAwDgYDVQQKDAdGaXJtYSBB&#13;
MQ4wDAYDVQQLDAVGaXJtYTEMMAoGA1UEBhMDc3JiMRowGAYJKoZIhvcNAQkBFgtmaXJtYUBhLmNv&#13;
bTEaMBgGCgmSJomT8ixkAQEMCjE0OTc5MTE2MTQwggEiMA0GCSqGSIb3DQEBAQUAA4IBDwAwggEK&#13;
AoIBAQCq+r0vhN2WlE0P9oCdhr3r0hyR5XKMa0NXUMez8a+0VhEe5bqCJfGObdJS1W1NChFMiioF&#13;
It+kwF4k4NoCHqsAJCkCBbKZTiltFfPtQg+GGmTI14RfC2Xrcgs060iPpswa0qePpyYxjM29ShAG&#13;
LFsVNKCLGLc733pn9i9FAuBbWhvGKigIGhm4UScWV9xTMK0cTlea9lRazgSM0D+iP0fasnfhIwHP&#13;
z1c3JOXRMFCHhk9jDRbHMMkDKu0AYtZo+rW87IDw+ddffeRAcYHtklVNUOWwWgPd+1ZhDrf8s+yG&#13;
ozc/wET+5q/yW5SFVxVEMIN+++m+aYlJWLt8rTNjhBDtAgMBAAGjEDAOMAwGA1UdEwEB/wQCMAAw&#13;
DQYJKoZIhvcNAQELBQADggEBABPql7l2SOkUU7ON9SEqNswIVn+RyAL+Y/9OBJ+0aU0lcvpgbFNZ&#13;
5GsCMufSLRK0z1HU2rKW969FAnxAbfvMAvTh8a1VKuSF1P259bjFSoCekPfDW8irKtdBwlXUQtfn&#13;
Av2mVWLhk9XhBQtN78BktFLuXG7aRfbgb6L/e9M6Z1XFM8QK5WzBo1Y/7C7js7R0thIX9OsBs0gD&#13;
yoK644NxtAH2JljgqREpcjKZwNhfXZ++SIK8O5zUM7hlo1C7N1XqkURhc7J5ADRIHf5cOJCqiE6d&#13;
Q2WnEbguq2W6D5tTN/qjfkOtu1AWa29vz3O2piue9WkfIqxC84/llz20jrIWfow=
</ds:X509Certificate>
</ds:X509Data>
</ds:KeyInfo>
</ds:Signature></SOAP-ENV:Envelope>